"""
2. Для списка реализовать обмен значений соседних элементов, т.е. Значениями обмениваются
элементы с индексами 0 и 1, 2 и 3 и т.д. При нечетном количестве элементов последний сохранить на
своем месте. Для заполнения списка элементов необходимо использовать функцию input().
"""
some_txt = input('Введите злементы списка через пробел между элементами, не более 7-ми элементов:\n>>>')
print('Это ваш список ?')

a = some_txt[0]
b = some_txt[1]
c = some_txt[2]
d = some_txt[3]
e = some_txt[4]
g = some_txt[5]
h = some_txt[6]

