"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к
 какому времени года относится месяц (зима, весна, лето,осень). Напишите
  решения через list и через dict.
"""
some_list = input('Введите любое число соответствующее месяцу года :')
some_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
a = some_list

e = a[0, 1, 11,] = input('Это зимний месяц!\n>>>')
b = a[2, 3, 4] = input('Это весенний месяц\n>>>')
c = a[5, 6, 7] = input('Это летний месяц\n>>>')
d = a[8, 9, 10] = input('Это осенний месяц\n>>>')
