"""
4. Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить
возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). При решении задания
необходимо обойтись без встроенной функции возведения числа в степень.

Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
"""


def power(a, y):
    res = 1
    for i in range(abs(y)):
        res *= a
    if y > 0:
        return res
    else:
        return 1 / res


print(power(float(input("Введите первое значение(положительное число - ")), int(input("Введите второе значение(степень, целое отрицательное число) - "))))
